{"config": [{"config": {"epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "batch_input_shape": [null, 5, 141], "beta_regularizer": null, "scale": true, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.3, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.3, "name": "lstm_1", "return_state": false, "activation": "tanh", "bias_regularizer": null, "stateful": false, "activity_regularizer": null, "recurrent_constraint": null, "implementation": 0, "trainable": true, "kernel_regularizer": null, "units": 64, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "return_sequences": false, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 64, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 3, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activation": "softmax"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.7"}